# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, PPA, [64]]
  - [-1, 1, Conv, [128, 3, 2]] # 2-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, PPA, [128]]
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, PPA, [256]]
  - [-1, 1, Conv, [512, 3, 2]] # 8-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 12
  - [-1, 2, C2PSA, [1024]] # 13

# YOLO11n head
head:
  - [3, 1, Conv, [128, 1, 1]]
  - [6, 1, Conv, [256, 1, 1]]

  - [[14, 15,], 1, ASFF2, [128, 0]] #16
  - [[14, 15,], 1, ASFF2, [256, 1]] #17

  - [-2, 1, C3k2, [128, False]]
  - [-2, 1, C3k2, [256, False]] # 19 (P4/16-medium)

  - [9, 1, Conv, [512,1,1]]

  - [[18, 19, 20], 1, ASFF3, [128, 0]]
  - [[18, 19, 20], 1, ASFF3, [256, 1]]
  - [[18, 19, 20], 1, ASFF3, [512, 2]]

  - [-3, 1, C3k2, [128, False]] #24
  - [-3, 1, C3k2, [256, False]] #25
  - [-3, 1, C3k2, [512, False]] #26
  - [13, 1, Conv, [1024, 1, 1]] #27
  - [0, 1, Conv, [64, 1, 1]]    #28

  - [[24, 25, 28], 1, DASI, [128]]
  - [[25, 26, 24], 1, DASI, [256]]
  - [[26, 27, 25], 1, DASI, [512]]

  - [[29, 30, 31], 1, Detect, [nc]] # Detect(P3, P4, P5)
